app/controllers/bios_controller.rb

SELECT `bios`.* FROM `bios`
---
  def index
    @bios = Bio.all