app/controllers/endorsees_controller.rb

  def index
  	@tiago_endorsees = TiagoEndorsee.all
  	@partners = Partner.all
  	@realizations = Realization.all
  	@patronages = Patronage.all
---
SELECT `tiago_endorsees`.* FROM `tiago_endorsees`
SELECT `partners`.* FROM `partners`
SELECT `realizations`.* FROM `realizations`
SELECT `patronages`.* FROM `patronages`