app/controllers/movies_controller.rb

SELECT `movies`.* FROM `movies`
---
  def index
    @movies = Movie.all