app/controllers/schedules_controller.rb

  def index
    @schedules = Schedule.all
---
SELECT `schedules`.* FROM `schedules`

  def show
    @schedule = Schedule.find(params[:id])
---
SELECT `schedules`.* FROM `schedules` WHERE `schedules`.`id` = 1 LIMIT 1

  def create
    @schedule = Schedule.new(params[:schedule])

    respond_to do |format|
      if @schedule.save
---
INSERT INTO `schedules` (`created_at`, `month`, `specification`, `updated_at`) VALUES ('2013-06-07 18:10:58', 'março', 'hsausahusa', '2013-06-07 18:10:58')

  def destroy
    @schedule = Schedule.find(params[:id])
    @schedule.destroy
---
SELECT `schedules`.* FROM `schedules` WHERE `schedules`.`id` = 1 LIMIT 1
DELETE FROM `schedules` WHERE `schedules`.`id` = 1