app/controllers/schools_controller.rb

  def index
    @schools = School.all
---
SELECT `schools`.* FROM `schools`