app/controllers/tiago_belems_controller.rb

  def index
    @tiago_belems = TiagoBelem.all
---
SELECT `tiago_belems`.* FROM `tiago_belems`